# CouldNotPlaceAdaptiveFamInst Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CouldNotPlaceAdaptiveFamInst Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Could not place Adaptive Family Instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CouldNotPlaceAdaptiveFamInst { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouldNotPlaceAdaptiveFamInst As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CouldNotPlaceAdaptiveFamInst {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace